intermediatePlus/pimpleFoam_LES_smagorinsky/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  LES;



RAS
{
    RASModel        kOmegaSST;

    turbulence      on;

    printCoeffs     on;
    // alphaK1	    500;
}


LES
{
    LESModel        Smagorinsky;

    turbulence      on;

    printCoeffs     on;
    // alphaK1	    500;
    delta           cubeRootVol;
    SmagorinskyCoeffs
    {
        Ck                  0.094;
        Ce                  1.048;
    }


}


// ************************************************************************* //
